# Yasir Alhejaili

### In each cell complete the task using pandas

In [2]:
import pandas as pd
import numpy as np

Read in the titanic.csv file in the `~/data` directory as a pandas dataframe called **df**

In [3]:
df = pd.read_csv('https://raw.githubusercontent.com/daniel-dc-cd/data_science/master/module_3_Python/data/titanic.csv')

Display the head of the dataframe

In [17]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

What is the percentage of people who survived? (hint find the mean of the survival column)

In [28]:
# To count the zeros and ones in a coulme
counts = df['Survived'].value_counts()
print(counts)
# To find the percentage of the survived people
survived_percentage = df.Survived.mean()
the_percentage = survived_percentage*100
print(int(the_percentage),"%")

0    549
1    342
Name: Survived, dtype: int64
38 %

In [15]:
# We can also find the mean if we use the describe() 
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

How many women and how many men survived?

In [92]:
# Survived
pepole_survived = df[(df['Survived'] == 1) & (df['Sex'] == "male") | (df['Sex'] == "female")]
pepole_survived["Sex"].value_counts()

# Dataframe
pepole_survived = pd.DataFrame(
{"Survived" : pepole_survived["Sex"].value_counts()})

pepole_survived

        Survived
female       314
male         109

What is the percentage of people that survied who paid a fare less than 10?

In [155]:
Fare_LessThan_10 = len(df[(df['Survived'] == 1) & (df['Fare'] < 10)])
print("Number of people who paid a fare less than 10 and survied = " ,Fare_LessThan_10)

print("Total number of people who survied = " ,len(df[df['Survived'] == 1]))

the_percentage = (Fare_LessThan_10/len(df[df['Survived'] == 1]))*100
print(f"The percentage of people who paid a fare less than 10 and survied = {int(the_percentage)} %")

Number of people who paid a fare less than 10 and survied =  67
Total number of people who survied =  342
The percentage of people who paid a fare less than 10 and survied = 19 %

What is the average age of those who didn't survive?

In [207]:
didnt_survived = len(df[(df['Survived'] == 0)])
print("All people that didn't servied = " ,didnt_survived)

Sum_Of_All_Ages = sum(df.Age.notna())
print("Total sum of all ages = " , Sum_Of_All_Ages)


x_survived = df[(df['Survived'] == 0)]
x_survived["Age"].mean()

print("The average age of those who didn't survive = " , x_survived["Age"].mean())

All people that didn't servied =  549
Total sum of all ages =  714
The average age of those who didn't survive =  30.62617924528302

What is the average age of those who did survive?

In [225]:
did_survived = len(df[(df['Survived'] == 1)])
print("All people that did servied = " ,did_survived)

Sum_Of_All_Ages = sum(df.Age.notna())
print("Total sum of all ages = " , Sum_Of_All_Ages)

that_survived = df[(df['Survived'] == 1)]
that_survived["Age"].mean()

print("The average age of those who did survive = " , that_survived["Age"].mean())

All people that did servied =  342
Total sum of all ages =  714
The average age of those who did survive =  28.343689655172415

What is the average age of those who did and didn't survive grouped by gender?

In [247]:
# All male average age
All_Male = df[(df["Sex"] == "male")]
print("All male average age = " ,All_Male["Age"].mean())

# All female average age
All_Female = df[(df["Sex"] == "female")]
print("All female average age = " ,All_Female["Age"].mean())

# Male that survied average age
Survied_Male = df[(df["Sex"] == "male") & (df["Survived"] == 1)]
print("Male that survied average age = " ,Survied_Male["Age"].mean())

# Female that survied average age
Survied_Female = df[(df["Sex"] == "female") & (df["Survived"] == 1)]
print("Female that survied average age = " ,Survied_Female["Age"].mean())

# Male that didn't survied average age
Didnt_Survied_Male = df[(df["Sex"] == "male") & (df["Survived"] == 0)]
print("Male that didn't survied average age = " ,Didnt_Survied_Male["Age"].mean())

# Female that didn't survied average age
Didnt_Survied_Female = df[(df["Sex"] == "female") & (df["Survived"] == 0)]
print("Female that didn't survied average age = " ,Didnt_Survied_Female["Age"].mean())

All male average age =  30.72664459161148
All female average age =  27.915708812260537
Male that survied average age =  27.276021505376345
Female that survied average age =  28.84771573604061
Male that didn't survied average age =  31.618055555555557
Female that didn't survied average age =  25.046875

## Tidy GDP

Manipulate the GDP.csv file and make it tidy, the result should be a pandas dataframe with the following columns:
* Country Name
* Country Code
* Year
* GDP

In [26]:
gdp = pd.read_csv('https://raw.githubusercontent.com/daniel-dc-cd/data_science/master/module_3_Python/data/GDP.csv', header=None,  skiprows=[0,1,2])
# Can also read it from local machine
# gdp = pd.read_csv('/Users/yasseralhrbi/Desktop/Saudi Digital Academy/data_science/module_3_Python/data/GDP.csv', header=None,  skiprows=[0,1,2])

In [92]:
gdp.head()

,0,1,2,3,4,5,6,7,8,9,...,53,54,55,56,57,58,59,60,61,62
0,Country Name,Country Code,Indicator Name,Indicator Code,1.960000e+03,1.961000e+03,1.962000e+03,1.963000e+03,1.964000e+03,1.965000e+03,...,2.009000e+03,2.010000e+03,2.011000e+03,2.012000e+03,2.013000e+03,2.014000e+03,2.015000e+03,2.016000e+03,2.017000e+03,NaN
1,Aruba,ABW,GDP (current US$),NY.GDP.MKTP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,2.498933e+09,2.467704e+09,2.584464e+09,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Afghanistan,AFG,GDP (current US$),NY.GDP.MKTP.CD,5.377778e+08,5.488889e+08,5.466667e+08,7.511112e+08,8.000000e+08,1.006667e+09,...,1.248694e+10,1.593680e+10,1.793024e+10,2.053654e+10,2.026425e+10,2.061610e+10,1.921556e+10,1.946902e+10,2.081530e+10,NaN
3,Angola,AGO,GDP (current US$),NY.GDP.MKTP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,7.549239e+10,8.252614e+10,1.041158e+11,1.139232e+11,1.249125e+11,1.267302e+11,1.026212e+11,9.533720e+10,1.242094e+11,NaN
4,Albania,ALB,GDP (current US$),NY.GDP.MKTP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,1.204421e+10,1.192695e+10,1.289087e+10,1.231978e+10,1.277628e+10,1.322824e+10,1.138693e+10,1.188368e+10,1.303935e+10,NaN

In [190]:
Tidy_GDP_1 = pd.DataFrame({ 'Country Name' : gdp.iloc[1: , 0] ,
                            'Country Code' : gdp.iloc[1: , 1] ,
                            'Year'         : gdp.iloc[0  , 4:]})

Tidy_GDP_1.fillna(0)

# I Know the solution is not correct but i need more time

     Country Name Country Code    Year
1           Aruba          ABW     0.0
2     Afghanistan          AFG     0.0
3          Angola          AGO     0.0
4         Albania          ALB  1960.0
5         Andorra          AND  1961.0
..            ...          ...     ...
260        Kosovo          XKX     0.0
261   Yemen, Rep.          YEM     0.0
262  South Africa          ZAF     0.0
263        Zambia          ZMB     0.0
264      Zimbabwe          ZWE     0.0

[264 rows x 3 columns]